W6D4/Art_Share_API(part 2)/app/controllers/artwork_shares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares"
---
  def index
    artwork_shares = ArtworkShare.all

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 19], ["viewer_id", 25], ["created_at", "2019-11-21 17:27:13.711044"], ["updated_at", "2019-11-21 17:27:13.711044"]]
---
  def create
    artwork_share = ArtworkShare.new(artwork_share_param)
    # replace the `artwork_attributes_here` with the actual attribute keys
    if artwork_share.save