W6D4/Art_Share_API(part 2)/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 21]]
SELECT "likes".* FROM "likes" WHERE (likable_id = 42 AND likable_type = 'Artwork')
SELECT "artworks".* FROM "artworks"
---
  def index
    if params.has_key?(:user_id)
      user = User.find(params[:user_id])
      artworks = Artwork.where(artist_id: params[:user_id])
      artworks += user.shared_artworks
    elsif params.has_key?(:artwork_id)
      artworks = Like.where("likable_id = #{params[:artwork_id]} AND likable_type = 'Artwork'")
    elsif params[:favorite_id]
      artworks = Favorite.where("artwork_id = #{params[:favorite_id]}")
    else
      artworks = Artwork.all

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Burning Man"], ["image_url", "burningman.com"], ["artist_id", 3], ["created_at", "2019-11-21 00:53:10.415649"], ["updated_at", "2019-11-21 00:53:10.415649"]]
---
  def create
    artwork = Artwork.new(artwork_params)
    # replace the `artwork_attributes_here` with the actual attribute keys
    if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    artwork = Artwork.find(params[:id])