W6D4/Art_Share_API(part 2)/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
SELECT "likes".* FROM "likes" WHERE (likable_id = 17 AND likable_type = 'Comment')
---
  def index
    comments = Comment.all
    if params.has_key?(:comment_id)
      comments = Like.where("likable_id = #{params[:comment_id]} AND likable_type = 'Comment'")

INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 30], ["artwork_id", 24], ["body", "i think im in love"], ["created_at", "2019-11-21 18:19:15.036017"], ["updated_at", "2019-11-21 18:19:15.036017"]]
---
  def create
    comment = Comment.new(comment_param)
    # replace the `artwork_attributes_here` with the actual attribute keys
    if comment.save