W6D4/Art_Share_API(part 2)/app/controllers/favorites_controller.rb

   def index
    favs = Favorite.all
---
SELECT "favorites".* FROM "favorites"