W6D5/ninety-nine-cats/app/models/cat_rental_request.rb

    def overlapping_requests
        curr_cat = self.cat_id
        curr_start_date = self.start_date
        curr_end_date = self.end_date
        requests = CatRentalRequest.where("cat_id = ? and start_date between ? and ?",curr_cat, curr_start_date,curr_end_date)
        requests2 = CatRentalRequest.where("cat_id = ? and end_date between ? and ?",curr_cat, curr_start_date,curr_end_date)
        requests3 = CatRentalRequest.where("cat_id = ? and start_date < ? and end_date > ?",curr_cat, curr_start_date,curr_end_date)
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE (cat_id = curr_cat and end_date between '2019-10-10' and '2019-10-15')