W6D3/First_Routes_Controllers/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "rich"], ["email", "rich@gmail.com"], ["created_at", "2019-11-20 23:03:44.450227"], ["updated_at", "2019-11-20 23:03:44.450227"]]
---
  def create
    user = User.new(params.require(:user).permit(:name,:email))
    # replace the `user_attributes_here` with the actual attribute keys
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "fuck2"], ["updated_at", "2019-11-20 23:33:54.963028"], ["id", 2]]
---
  def update
    user = User.find(params[:id])
    if user.update(params.require(:user).permit(:name,:email))