W6D3/Art_Share_API/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Burning Man"], ["image_url", "burningman.com"], ["artist_id", 3], ["created_at", "2019-11-21 00:53:10.415649"], ["updated_at", "2019-11-21 00:53:10.415649"]]
---
  def create
    artwork = Artwork.new(artwork_params)
    # replace the `artwork_attributes_here` with the actual attribute keys
    if artwork.save